In [1]:
import pandas as pd

In [2]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [3]:
# 하나의 column을 받았을 때 전체값에서 '-'라는 값으로 분류해서 list를 만들고 그 리스트의 첫번째 인자를 return
def extract_year(column):
    return column.split('-')[0]

In [5]:
# 모든 row들을 row 하나씩 함수를 적용시킴. for문을 적용하지 않고도 모든 row에 column을 하나씩 만들어 줄 수 있음.
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [6]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [7]:
# parameter
def get_age(year, current_year):
    return current_year - int(year)

In [8]:
df['age'] = df['year'].apply(get_age,current_year=2021)

In [9]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2002-09-24  2002   19
2  2005-12-20  2005   16

In [15]:
# multiple parameter
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [16]:
df['introduce'] = df['age'].apply(get_introduce, prefix='I am ', suffix=' years old')

In [17]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   21  I am 21 years old
1  2002-09-24  2002   19  I am 19 years old
2  2005-12-20  2005   16  I am 16 years old

In [18]:
def get_introduce_2(row):
    return "I was born in " + str(row.year) + " my age is " + str(row.age)

In [19]:
df.introduce = df.apply(get_introduce_2, axis=1)

In [20]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   21  I was born in 2000 my age is 21
1  2002-09-24  2002   19  I was born in 2002 my age is 19
2  2005-12-20  2005   16  I was born in 2005 my age is 16